src/cf/DataProcessors/РаботаСРезультатамиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РаботаСРезультатамиОбмена</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/РезультатыОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РезультатыОбменаДанными</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВозникновения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пропущена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначенияОтборовНезависимогоРегистра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипПроблемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПроблемОбменаДанными</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроблемныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючУникальности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДействияПриПолученииДанныхОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДействияПриПолученииДанныхОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Загружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КакЗагружать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДействийПриПолученииДанныхОбмена</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстанавливатьСоответствия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНеобходимостиУстановкиСоответствийПриПолученииДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтратегияПоискаПоКлючам</Name>
					<Comment>Может принимать значения "Оптимально" или "Стандарт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗначенияУстановленыАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновленияСтратегииПоиска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаДобавления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныДобавленияВРегистрОбъектыКЗагрузке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбрабатываемойВерсии</Name>
					<Comment>Соответствует дате добавления в РС "Прочитанные данные сообщений обмена". Если отличается, то были прочитаны новые данные</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСконвертированногоОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбновленияОбъектаВИБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбновленияОбъектаПриПроблемахЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСсылкаНаОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаФорматаЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИменОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ПричиныДобавленияВРегистрОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныДобавленияВРегистрОбъектыКЗагрузке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетЗагрузкуДругихОбъектов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПолучениеЭтогоОбъекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПоискСоответствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКонвертации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроверкиПриЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданоНаКонвертацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовоКЗагрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаОтклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/РаботаСРезультатамиОбмена/Forms/РазборРезультатовПообъектногоОбмена/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ОбработатьПереданныеПараметры();
	
	ЗаполнитьПанельНавигацииЗадачОбмена(Ложь);
	
	СформироватьТекстСкрытьПоказатьПодсказку(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСРезультатамиОбмена.ОбработатьСохраненныеНастройкиОтбораОбъектыМетаданныхПередЗагрузкой(
		Настройки, ДоступныеДляОтбораТипыОбъектов, ОбъектыМетаданныхОтбор, Список);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если НеОтображатьПодсказки Тогда
		
		ЗаполнитьПанельНавигацииЗадачОбмена(Истина);
		СформироватьТекстСкрытьПоказатьПодсказку(ЭтотОбъект);
	
	КонецЕсли;
	
	УстановитьОтборПоПериоду();
	
	УстановитьОтборПричина();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ПричинаДобавленияОбъектыКЗагрузке" Тогда
		
		Элементы.Список.Обновить();
		ЗаполнитьПанельНавигацииЗадачОбмена(Ложь);
		
	ИначеЕсли ИмяСобытия = "Запись_ДействияПриПолученииДанныхОбмена" Тогда 
		
		ЗаполнитьПанельНавигацииЗадачОбмена(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПолученияНавигационнойСсылки(Ключ, Представление, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НавигационнаяСсылка = НавигационнаяСсылкаФормы;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

#Область ИзменениеОтборовСпискаВсеПроблемы

&НаКлиенте
Процедура ПроблемаОтборНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РаботаСРезультатамиОбменаКлиент.МножественныйОтборСпискаНачалоВыбора(ЭтотОбъект,
	                                                                     Элемент,
	                                                                     ПроблемаОтбор,
	                                                                     Тип("ПеречислениеСсылка.ПричиныДобавленияВРегистрОбъектыКЗагрузке"),
	                                                                     НСтр("ru = 'Выбранные проблемы'"),
	                                                                     РаботаСРезультатамиОбменаКлиентСервер.ТипыПричинДобавленияДляРаботыСРезультатамиОбмена(),
	                                                                     ИзмененныеПредставленияПричинДобавления());
КонецПроцедуры

&НаКлиенте
Процедура ПроблемаОтборПриИзменении(Элемент)
	
	УстановитьОтборПричина();
	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура ОбъектыМетаданныхОтборПриИзменении(Элемент)
	
	УстановитьОтборТипМетаданных();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхОтборНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РаботаСРезультатамиОбменаКлиент.МножественныйОтборСпискаНачалоВыбора(ЭтотОбъект,
	                                                                     Элемент,
	                                                                     ОбъектыМетаданныхОтбор,
	                                                                     Неопределено,
	                                                                     НСтр("ru = 'Выбранные типы объектов'"),
	                                                                     ДоступныеДляОтбораТипыОбъектов);
	
КонецПроцедуры

#Область ОбработкаНавигационныхСсылок

&НаКлиенте
Процедура ДекорацияДействияПриПолученииДанныхОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьФормуДействияПриПолученияДанных" Тогда 
		
		РаботаСРезультатамиОбменаКлиент.ОткрытьФормуДействияПриПолученииДанныхОбмена(УзелИнформационнойБазы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПроблемыПообъектногоОбменаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбработкаОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормыПроблемы", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ИзменитьНастройкиДействияПриПолучении" Тогда 
		
		РаботаСРезультатамиОбменаКлиент.ОткрытьФормуДействияПриПолученииДанныхОбмена(УзелИнформационнойБазы);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьФормуОшибкаКонвертации" Тогда
		
		ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ОшибкиКонвертации", ПараметрыОткрытия, ЭтотОбъект,,,,
		             ОбработкаОповещенияОЗакрытии, РежимОткрытияОкнаФормы.Независимый);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьФормуОшибкиЗаписиЗагруженные" Тогда
		
		ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ЗагруженныеОбъектыСПроблемамиПриЗаписи", ПараметрыОткрытия, ЭтотОбъект,,,,
		             ОбработкаОповещенияОЗакрытии, РежимОткрытияОкнаФормы.Независимый);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьФормуОшибкиЗаписиНеЗагруженные" Тогда
		
		ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.НеЗагруженныеОбъектыСПроблемамиПриЗаписи", ПараметрыОткрытия, ЭтотОбъект,,,,
		             ОбработкаОповещенияОЗакрытии, РежимОткрытияОкнаФормы.Независимый); 
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьФормуОжидаетЗагрузкуДругихОбъектов" Тогда
		
		ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ОжидаютЗагрузкуДругихОбъектов", ПараметрыОткрытия, ЭтотОбъект,,,,
		             ОбработкаОповещенияОЗакрытии, РежимОткрытияОкнаФормы.Независимый);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьФормуОжидаетПолучениеЭтогоОбъекта" Тогда
		
		ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ОбъектыТребующиеПолучения", ПараметрыОткрытия, ЭтотОбъект,,,,
		             ОбработкаОповещенияОЗакрытии, РежимОткрытияОкнаФормы.Независимый);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьФормуТребуетсяПодтверждение" Тогда
		
		ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ТребуетсяПодтверждение", ПараметрыОткрытия, ЭтотОбъект,,,,
		             ОбработкаОповещенияОЗакрытии, РежимОткрытияОкнаФормы.Независимый); 
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьФормуУстановкаСоответствий" Тогда
		
		ОткрытьФорму("Обработка.РаботаСРезультатамиОбмена.Форма.ОбъектыКПоискуИУстановкеСоответствий", ПараметрыОткрытия, ЭтотОбъект,,,,
		             ОбработкаОповещенияОЗакрытии, РежимОткрытияОкнаФормы.Независимый);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроблемыНеПообъектногоОбменаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УзлыОбмена = Новый Массив;
	УзлыОбмена.Добавить(УзелИнформационнойБазы);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УзлыОбмена",              УзлыОбмена);
	ПараметрыФормы.Вставить("ОтборУзловОбменов",       УзлыОбмена);
	ПараметрыФормы.Вставить("ОтборТипыПредупреждений", "Получение");
	
	ОткрытьФорму("РегистрСведений.РезультатыОбменаДанными.Форма.ПредупрежденияСинхронизаций", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСкрытьПоказатьПодсказкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "СкрытьПодсказки" Тогда
		
		НеОтображатьПодсказки = Истина;
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПоказатьПодсказки" Тогда
		
		НеОтображатьПодсказки = Ложь;
		
	КонецЕсли;
	
	СформироватьТекстСкрытьПоказатьПодсказку(ЭтотОбъект);
	
	ЗаполнитьПанельНавигацииЗадачОбмена(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияДействияПриПолученииДанныхОбменаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьФормуДействияПриПолученииДанныхОбменаТребующиеПодтверждения" Тогда
		
		РаботаСРезультатамиОбменаКлиент.ОткрытьФормуДействияПриПолученииДанныхОбмена(УзелИнформационнойБазы, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	РаботаСРезультатамиОбмена.ПолучитьПредставленияОбъектовПриПолученииДанныхНаСервереСписка(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "СписокПредставлениеОбъекта" Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ВнешняяСсылкаНаОбъект) Тогда
			ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ТекущиеДанные.ВнешняяСсылкаНаОбъект);
		Иначе
			ОткрытьФормуПроблемы(ТекущиеДанные);
		КонецЕсли;
		
	ИначеЕсли Поле.Имя = "СписокСсылкаНаОбъект" Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.СоответствиеВИБ) Тогда
			ПоказатьЗначение(, ТекущиеДанные.СоответствиеВИБ);
		Иначе
			ОткрытьФормуПроблемы(ТекущиеДанные);
		КонецЕсли;
		
	Иначе
		
		ОткрытьФормуПроблемы(ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура ОбновитьТипыПроблем(Команда)
	
	ЗаполнитьПанельНавигацииЗадачОбмена(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	Оповещение = Новый ОписаниеОповещения("УстановитьИнтервалЗавершение", ЭтотОбъект);
	
	РаботаСРезультатамиОбменаКлиент.РедактироватьПериод(Период, , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроблему(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта'"));
		Возврат;
		
	КонецЕсли;
	
	ОткрытьФормуПроблемы(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияФормы

&НаСервере
Процедура ОбработатьПереданныеПараметры()
	
	УзелИнформационнойБазы = Параметры.УзелИнформационнойБазы;
	
	Если Не ЗначениеЗаполнено(УзелИнформационнойБазы) Тогда
		
		ТекстИсключения = НСтр("ru = 'В рабочее место по разбору результатов обмена не передан узел приложения-корреспондента.'");
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "УзелПланаОбмена", УзелИнформационнойБазы, Истина); 
	
	ЦветГиперссылки = ЦветаСтиля.ГиперссылкаЦвет;
	
	ИмяУзла = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УзелИнформационнойБазы, "Наименование");
	
	Заголовок = СтрШаблон(НСтр("ru = 'Работа с результатами обмена (%1)'"), ИмяУзла);
	
	НавигационнаяСсылкаФормы = ПолучитьНавигационнуюСсылку(
		Метаданные.Обработки.РаботаСРезультатамиОбмена, Заголовок, Новый Структура("УзелИнформационнойБазы", УзелИнформационнойБазы));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	СписокУсловноеОформление = Список.КомпоновщикНастроек.Настройки.УсловноеОформление;
	СписокУсловноеОформление.Элементы.Очистить();
	
	РаботаСРезультатамиОбмена.УстановитьУсловноеОформлениеИдентификаторПолученногоОбъекта(СписокУсловноеОформление, "ПредставлениеОбъекта"); 
	
	РаботаСРезультатамиОбмена.УстановитьУсловноеОформлениеТипОбъекта(СписокУсловноеОформление);
	
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Переопределение причины добавления для различных ошибок при записи.'");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("ТипПроблемы");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТипПроблемы");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Загружен с проблемой при записи'"));
	
	Элемент = СписокУсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Переопределение причины добавления для различных ошибок при записи.'");
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("ТипПроблемы");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТипПроблемы");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Не загружен из-за проблемы при записи'")); 
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДанныхФормы

&НаСервере
Процедура ЗаполнитьПанельНавигацииЗадачОбмена(БезПовторногоПолученияДанных)
	
	ЗаполнитьИнформациюДействияПриПолученииДанныхОбмена(БезПовторногоПолученияДанных);
	
	ЗаполнитьЗадачуПроблемыНеПообъектногоОбмена(БезПовторногоПолученияДанных); 
	
	ЗаполнитьЗадачиПроблемыПообъектногоОбмена(БезПовторногоПолученияДанных);
	
КонецПроцедуры

#Область ХранениеРезультатовЗаполнения

&НаСервере
Функция НовыйДанныеЗадач()
	
	ДанныеЗадач = Новый Структура;
	
	ДанныеЗадач.Вставить("НеПообъектныйОбмен",   0);
	ДанныеЗадач.Вставить("ДействияПриПолучении", 0);
	ДанныеЗадач.Вставить("ПообъектныйОбмен",     Новый Соответствие);
	
	Возврат ДанныеЗадач;
	
КонецФункции

&НаСервере
Функция ЗначениеСохраненныхДанныхЗадач(Ключ)
	
	Если СохраненныеДанныеЗадач = Неопределено Тогда
		
		СохраненныеДанныеЗадач = НовыйДанныеЗадач();
		
	КонецЕсли;
	
	Возврат СохраненныеДанныеЗадач[Ключ];
	
КонецФункции

&НаСервере
Процедура УстановитьЗначениеСохраненныеДанныеЗадач(Ключ, Значение)
	
	Если СохраненныеДанныеЗадач = Неопределено Тогда
		
		СохраненныеДанныеЗадач = НовыйДанныеЗадач();
		
	КонецЕсли;
	
	СохраненныеДанныеЗадач[Ключ] = Значение;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияПриПолученииДанныхОбмена

&НаСервере
Процедура ЗаполнитьИнформациюДействияПриПолученииДанныхОбмена(БезПовторногоПолученияДанных)
	
	Если БезПовторногоПолученияДанных Тогда
		
		КоличествоОбъектов = ЗначениеСохраненныхДанныхЗадач("ДействияПриПолучении");
		
	Иначе
	
		КоличествоОбъектов = РегистрыСведений.ДействияПриПолученииДанныхОбмена.КоличествоОбъектовЗначенияУстановленыАвтоматически(УзелИнформационнойБазы);
		УстановитьЗначениеСохраненныеДанныеЗадач("ДействияПриПолучении", КоличествоОбъектов);
		
	КонецЕсли;
	
	Если КоличествоОбъектов = 0 Тогда
		
		Элементы.ДекорацияДействияПриПолученииДанныхОбмена.Видимость = Ложь;
		
	Иначе
		
		ТипЗадачи = "ДействияПриПолученииДанныхОбмена";
		
		Если НеОтображатьПодсказки Тогда
			
			ЗаголовокДекорации = Новый ФорматированнаяСтрока(ТекстПоТипуЗадачи(ТипЗадачи, КоличествоОбъектов));
			
		Иначе
			
			ЗаголовокДекорации = Новый ФорматированнаяСтрока(ТекстПоТипуЗадачи(ТипЗадачи, КоличествоОбъектов),
			                                                 Символы.ПС, 
			                                                 ПояснениеПоТипуПроблемы(ТипЗадачи));
			
		КонецЕсли;
		
		Элементы.ДекорацияДействияПриПолученииДанныхОбмена.Заголовок = ЗаголовокДекорации;
		
		Элементы.ДекорацияДействияПриПолученииДанныхОбмена.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТекстГиперссылкиНастройкиДействийПриПолучении()
	
	Возврат СтроковыеФункции.ФорматированнаяСтрока("<a href = ""%1""><span style=""color:ПоясняющийТекст"">%2</span></a>", 
	                                               "ИзменитьНастройкиДействияПриПолучении",
	                                                НСтр("ru = 'Изменить настройки'"));
	
КонецФункции

#КонецОбласти

#Область НеПообъектныйОбмен

&НаСервере
Процедура ЗаполнитьЗадачуПроблемыНеПообъектногоОбмена(БезПовторногоПолученияДанных)
	
	Если БезПовторногоПолученияДанных Тогда
		
		КоличествоПредупрежденийПолучения = ЗначениеСохраненныхДанныхЗадач("НеПообъектныйОбмен");
		
	Иначе
	
		ДанныеПроблемНеПообъектногоОбмена = РегистрыСведений.РезультатыОбменаДанными.КоличествоПредупрежденийДетально(УзелИнформационнойБазы);
		КоличествоПредупрежденийПолучения  = ДанныеПроблемНеПообъектногоОбмена.КоличествоПредупрежденийПолучения;
		УстановитьЗначениеСохраненныеДанныеЗадач("НеПообъектныйОбмен", ДанныеПроблемНеПообъектногоОбмена.КоличествоПредупрежденийПолучения);
		
	КонецЕсли;
	
	Если КоличествоПредупрежденийПолучения = 0 Тогда
		
		Элементы.НадписьПроблемыНеПообъектногоОбмена.Видимость = Ложь;
		
	Иначе
		
		Элементы.НадписьПроблемыНеПообъектногоОбмена.Видимость = Истина;
		ТекстЗадачи = СтрШаблон(НСтр("ru = 'Ознакомиться с предупреждениями, полученными в предыдущей версии обмена - %1'"), КоличествоПредупрежденийПолучения);
		ТекстПроблемыНеПообъектныйОбмен = СтроковыеФункции.ФорматированнаяСтрока("<a href = ""%1"">%2</a>", 
		                                                                          "ОткрытьФормуПредупрежденийПредыдущийОбмен",
		                                                                          ТекстЗадачи); 
		
		Если Не НеОтображатьПодсказки Тогда
			ТекстПояснения = НСтр("ru = 'Перейти к предупреждениям, полученным в предыдущей версии обмена. В ней недоступна повторная загрузка объекта, но есть возможность ознакомиться с возникшими проблемами и исправить проблемы, возникшие при записи объектов.'");
			ТекстПояснения = СтроковыеФункции.ФорматированнаяСтрока("<span style=""color:ПоясняющийТекст"">%1</span>", ТекстПояснения);
			
			ТекстПроблемыНеПообъектныйОбмен = Новый ФорматированнаяСтрока(ТекстПроблемыНеПообъектныйОбмен,
			                                                              Символы.ПС, 
			                                                              ТекстПояснения);
		КонецЕсли;
		
		Элементы.НадписьПроблемыНеПообъектногоОбмена.Заголовок = ТекстПроблемыНеПообъектныйОбмен;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПообъектныйОбмен

&НаСервере
Процедура ЗаполнитьЗадачиПроблемыПообъектногоОбмена(БезПовторногоПолученияДанных)
	
	Если БезПовторногоПолученияДанных Тогда
		
		ДанныеПроблемПообъектногоОбмена = ЗначениеСохраненныхДанныхЗадач("ПообъектныйОбмен");
		
	Иначе
		
		ДанныеПроблемПообъектногоОбмена = РегистрыСведений.ОбъектыКЗагрузке.КоличествоТиповПроблемПоУзлуПланаОбмена(УзелИнформационнойБазы);
		УстановитьЗначениеСохраненныеДанныеЗадач("ПообъектныйОбмен", ДанныеПроблемПообъектногоОбмена);
		ЗаполнитьСписокВыбораОбъектыМетаданных();
		
	КонецЕсли;
		
	ВсегоПроблем = ДанныеПроблемПообъектногоОбмена.Получить("ВсегоПроблем");
	
	Если ВсегоПроблем = 0 Тогда
		
		Элементы.ГруппаПроблемыПообъектногоОбмена.Видимость = Ложь;
		
	Иначе
		
		Элементы.ГруппаПроблемыПообъектногоОбмена.Видимость = Истина;
		
		ТекстЗадачиПообъектныйОбмен = "";
		
		ТребуетсяПереводСтроки = Ложь;
		
		Для Каждого ТипПроблемы Из РаботаСРезультатамиОбменаКлиентСервер.ТипыПричинДобавленияДляРаботыСРезультатамиОбмена() Цикл
			
			КоличествоПроблем = ДанныеПроблемПообъектногоОбмена.Получить(ТипПроблемы);
			Если КоличествоПроблем <> Неопределено
				И КоличествоПроблем > 0 Тогда 
				
				ТекстЗадачиПообъектныйОбмен = Новый ФорматированнаяСтрока(ТекстЗадачиПообъектныйОбмен,
				                                                          ?(ТребуетсяПереводСтроки, Символы.ПС + Символы.ПС, ""), 
				                                                          ТекстПоТипуЗадачи(ТипПроблемы, КоличествоПроблем));
				
				Если Не НеОтображатьПодсказки Тогда
					ТекстЗадачиПообъектныйОбмен = Новый ФорматированнаяСтрока(ТекстЗадачиПообъектныйОбмен,
					                                                          Символы.ПС, 
					                                                          ПояснениеПоТипуПроблемы(ТипПроблемы));
				КонецЕсли;
				
				ТребуетсяПереводСтроки = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Элементы.ДекорацияПроблемыПообъектногоОбмена.Заголовок = ТекстЗадачиПообъектныйОбмен;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОбъектыМетаданных()

	ДоступныеДляОтбораТипыОбъектов = РегистрыСведений.ОбъектыКЗагрузке.ТипыОбъектовМетаданныхСПроблемами(
		УзелИнформационнойБазы, РаботаСРезультатамиОбменаКлиентСервер.ТипыПричинДобавленияАнализируемыеПриОтработкеПользователем());
	
КонецПроцедуры

#КонецОбласти

#Область ВыводГиперссылокПерехода

&НаСервере
Функция ТекстПоТипуЗадачи(ТипПроблемы, КоличествоПроблем)
	
	Если ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПодтверждение Тогда
		
		ПредставлениеПроблемы = НСтр("ru = 'Подтвердить загрузку объектов'");
		
	ИначеЕсли ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия Тогда
		
		ПредставлениеПроблемы = НСтр("ru = 'Установить соответствия для объектов'");
		
	ИначеЕсли ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи Тогда
		
		ПредставлениеПроблемы = НСтр("ru = 'Решить проблемы с загруженными объектами, у которых возникли проблемы при записи'");
		
	ИначеЕсли ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи Тогда
		
		ПредставлениеПроблемы = НСтр("ru = 'Получить объекты, незагруженные из-за проблем при записи'");
		
	ИначеЕсли ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетЗагрузкуДругихОбъектов Тогда
		
		ПредставлениеПроблемы = НСтр("ru = 'Ознакомиться с объектами, ожидающими загрузку других объектов'");
		
	ИначеЕсли ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта Тогда
		
		ПредставлениеПроблемы = НСтр("ru = 'Ознакомиться с объектами, требующими получения'");
		
	ИначеЕсли ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаКонвертации Тогда
		
		ПредставлениеПроблемы = НСтр("ru = 'Ознакомиться с данными, которые не удалось сконвертировать.'");
		
	ИначеЕсли ТипПроблемы = "ДействияПриПолученииДанныхОбмена" Тогда
		
		ПредставлениеПроблемы = НСтр("ru = 'Подтвердить или изменить настройки получения данных, установленные автоматически'");
		
	КонецЕсли;
	
	ТекстКоличествоПроблем   = СтрШаблон(НСтр("ru = '%1 - %2'"), ПредставлениеПроблемы, КоличествоПроблем);
	ТекстЗадачиСГиперссылкой = СтроковыеФункции.ФорматированнаяСтрока("<a href = ""%1"">%2</a>", 
	                                                                  ТекстНавигационнойСсылкиПоТипуПроблемы(ТипПроблемы),
	                                                                  ТекстКоличествоПроблем);
	
	Возврат ТекстЗадачиСГиперссылкой;
	
КонецФункции

&НаСервере
Функция ПояснениеПоТипуПроблемы(ТипПроблемы)
	
	Если ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПодтверждение Тогда
		
		ПояснениеПроблемы = НСтр("ru = 'Перейти к подтверждению загрузки объекта. Возникает, если в настройках действий при получении обмена указано, что при получении объектов определенного типа загрузка выполняется только после подтверждения пользователем.'");
		
	ИначеЕсли ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия Тогда
		
		ПояснениеПроблемы = НСтр("ru = 'Перейти к установке соответствий для объектов, ожидающих загрузку и не имеющих соответствия в текущей информационной базе. Возникает, если для типа объекта установлена настройка необходимости установки соответствий посредством помощника.'");
		
	ИначеЕсли ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи Тогда
		
		ПояснениеПроблемы = НСтр("ru = 'Перейти к проблемам возникшим при записи загруженного объекта. Ошибки могли возникнуть при проведении или записи объекта. Возможность дозаполнить реквизиты или попробовать загрузить объект заново.'");
		
		ИначеЕсли ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи Тогда
		
		ПояснениеПроблемы = НСтр("ru = 'Перейти к списку объектов, не загруженных из за проблем при записи. Ошибки могли возникнуть при проведении или записи объекта. Возможность загрузить и дозаполнить объект.'");
		
	ИначеЕсли ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетЗагрузкуДругихОбъектов Тогда
		
		ПояснениеПроблемы = НСтр("ru = 'Перейти к списку объекты, которые не были загружены, так как не были получены содержащиеся в них объекты. Возможность посмотреть недостающие для загрузки объекты или загрузить объект без них.'");
		
	ИначеЕсли ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта Тогда
		
		ПояснениеПроблемы = НСтр("ru = 'Перейти к списку объектов, получение которые требуется для получения других объектов.'");
		
	ИначеЕсли ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаКонвертации Тогда
		
		ПояснениеПроблемы = НСтр("ru = 'Перейти к проблемам, возникшим при конвертации полученных объектов. Возможность ознакомиться с проблемами, попытаться решить и загрузить объекты.'");
		
	ИначеЕсли ТипПроблемы = "ДействияПриПолученииДанныхОбмена" Тогда
		
		ПояснениеПроблемы = НСтр("ru = 'Перейти к подтверждению действий при получении данных обмена, которые были установлены автоматически. Такая ситуация возникает при изменении состава типов объектов, которые могут быть загружены. Возможность внести необходимые изменения в настройку.'");
		
	КонецЕсли;
	
	ТекстПояснения = СтроковыеФункции.ФорматированнаяСтрока("<span style=""color:ПоясняющийТекст"">%1</span>", ПояснениеПроблемы);
	
	Если ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПодтверждение
		Или ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия Тогда
		
		ТекстПояснения = Новый ФорматированнаяСтрока(ТекстПояснения, " ", ТекстГиперссылкиНастройкиДействийПриПолучении());
		
	КонецЕсли;
	
	Возврат ТекстПояснения;
	
КонецФункции

&НаСервере
Функция ТекстНавигационнойСсылкиПоТипуПроблемы(ТипПроблемы)
	
	ТекстНавигационнойСсылки = "";
	
	Если ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПодтверждение Тогда
		
		ТекстНавигационнойСсылки = "ОткрытьФормуТребуетсяПодтверждение";
		
	ИначеЕсли ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ТребуетсяПоискСоответствия Тогда
		
		ТекстНавигационнойСсылки = "ОткрытьФормуУстановкаСоответствий";
		
	ИначеЕсли ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи Тогда
		
		ТекстНавигационнойСсылки = "ОткрытьФормуОшибкиЗаписиЗагруженные";
		
	ИначеЕсли ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи Тогда
		
		ТекстНавигационнойСсылки = "ОткрытьФормуОшибкиЗаписиНеЗагруженные";
		
	ИначеЕсли ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетЗагрузкуДругихОбъектов Тогда
		
		ТекстНавигационнойСсылки = "ОткрытьФормуОжидаетЗагрузкуДругихОбъектов";
		
	ИначеЕсли ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОжидаетсяПолучениеЭтогоОбъекта Тогда
		
		ТекстНавигационнойСсылки = "ОткрытьФормуОжидаетПолучениеЭтогоОбъекта";
		
	ИначеЕсли ТипПроблемы = Перечисления.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаКонвертации Тогда
		
		ТекстНавигационнойСсылки = "ОткрытьФормуОшибкаКонвертации";
		
	ИначеЕсли ТипПроблемы = "ДействияПриПолученииДанныхОбмена" Тогда
		
		ТекстНавигационнойСсылки = "ОткрытьФормуДействияПриПолученииДанныхОбменаТребующиеПодтверждения";
		
	КонецЕсли;
	
	Возврат ТекстНавигационнойСсылки;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область УправлениеЭлементамиФормы

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьТекстСкрытьПоказатьПодсказку(Форма)

	Если Форма.НеОтображатьПодсказки Тогда
		
		ТекстЗаголовка = НСтр("ru = 'Показать подсказки'");
		ТекстКоманды   = "ПоказатьПодсказки";
		
	Иначе
		
		ТекстЗаголовка = НСтр("ru = 'Скрыть подсказки'");
		ТекстКоманды   = "СкрытьПодсказки";
		
	КонецЕсли;
	
	Форма.Элементы.ДекорацияСкрытьПоказатьПодсказки.Заголовок = Новый ФорматированнаяСтрока(ТекстЗаголовка,, Форма.ЦветГиперссылки,, ТекстКоманды);
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеОтбораПричина

&НаСервере
Процедура УстановитьОтборПричина()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
	                                                                        "ТипПроблемы",
	                                                                        ПроблемаОтбор,
	                                                                        ВидСравненияКомпоновкиДанных.ВСписке,
	                                                                        ,
	                                                                        ПроблемаОтбор.Количество() > 0);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИзмененныеПредставленияПричинДобавления()

	ИзмененныеПредставления = Новый Соответствие;
	
	ИзмененныеПредставления.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаЗаписи"), 
	                                 НСтр("ru = 'Загружен с проблемой при записи'"));
	ИзмененныеПредставления.Вставить(ПредопределенноеЗначение("Перечисление.ПричиныДобавленияВРегистрОбъектыКЗагрузке.ОшибкаПроверкиПриЗаписи"), 
	                                 НСтр("ru = 'Не загружен из-за проблемы при записи'"));
	
	Возврат ИзмененныеПредставления;

КонецФункции

#КонецОбласти

#Область ИзменениеОтборов

&НаКлиенте
Процедура ФормаМножественногоОтбораПослеЗакрытия(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДополнительныеПараметры.Свойство("Элемент") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.Элемент = Элементы.ПроблемаОтбор Тогда
		
		ПроблемаОтбор = Результат;
		УстановитьОтборПричина();
		
	ИначеЕсли ДополнительныеПараметры.Элемент = Элементы.ОбъектыМетаданныхОтбор Тогда

		ОбъектыМетаданныхОтбор = Результат;
		УстановитьОтборТипМетаданных();
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборТипМетаданных()
	
	РаботаСРезультатамиОбмена.УстановитьОтборТипМетаданныхВСписке(Список, ОбъектыМетаданныхОтбор);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт

	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Период = ВыбранноеЗначение;
	УстановитьОтборПоПериоду();

КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборПоПериоду()
	
	Список.Параметры.УстановитьЗначениеПараметра("НачалоПериода",
		Период.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("КонецПериода", 
		?(ЗначениеЗаполнено(Период.ДатаОкончания), Период.ДатаОкончания, КонецДня(Дата(3999, 12, 31)))); 
		
	Элементы.ДекорацияОтборПериод.Заголовок = ПредставлениеПериода(Период.ДатаНачала, Период.ДатаОкончания,);
	
КонецПроцедуры

#КонецОбласти

#Область ФормаПроблемы

&НаКлиенте
Процедура ОткрытьФормуПроблемы(ТекущиеДанные)

	ДанныеЗаписи = РаботаСРезультатамиОбменаКлиентСервер.НовыйКлючЗаписиОбъектыКЗагрузке();
	
	ДанныеЗаписи.ПолученныйОбъект   = ТекущиеДанные.ПолученныйОбъект;
	ДанныеЗаписи.ПравилоКонвертации = ТекущиеДанные.ПравилоКонвертации;
	ДанныеЗаписи.УзелПланаОбмена    = УзелИнформационнойБазы;
	ДанныеЗаписи.ОбъектФормата      = ТекущиеДанные.ОбъектФормата;
	
	ОповещениеОЗакрытииФормыПроблемы = Новый ОписаниеОповещения("ПослеЗакрытияФормыПроблемы", ЭтотОбъект);
	
	ТипПроблемы = РаботаСРезультатамиОбменаКлиентСервер.ПричинаДобавленияИлиСтатусОбновленияВИБ(
		ТекущиеДанные.ТипПроблемы, ТекущиеДанные.СтатусОбновленияОбъектаВИБ);
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуПроблемы(
		ДанныеЗаписи, ЭтотОбъект, 
		ТипПроблемы, ОповещениеОЗакрытииФормыПроблемы);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыПроблемы(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Результат.УстановленоСоответствие Тогда
		
		ПроверитьБлокируемыеОбъектыФоновоеЗадание(Результат.ПолученныйОбъект,
		                                          Результат.ОбъектФормата,
		                                          УзелИнформационнойБазы,
		                                          Результат.ИдентификаторФоновогоЗадания);
		
	КонецЕсли;
		
	Если Результат.ОткрытьОбъектИБПослеОбработки
		И ЗначениеЗаполнено(Результат.ОбъектИБ) Тогда
		
		ПоказатьЗначение(, Результат.ОбъектИБ);
		
	ИначеЕсли Результат.ПереоткрытьФормуПроблему Тогда
		
		РаботаСРезультатамиОбменаКлиент.ПереоткрытьФормуПроблемыПослеОтработки(ЭтотОбъект, Результат);
		
	ИначеЕсли Результат.ТребуетсяЗакрытиеИВыводПредупреждения Тогда
		
		ПоказатьПредупреждение(,Результат.ТекстПредупреждения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПослеУстановкиСоответствия

&НаКлиенте
Процедура ПроверитьБлокируемыеОбъектыФоновоеЗадание(ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы, КлючФоновогоЗадания)
	
	ДлительнаяОперация = ДлительнаяОперацияПослеУстановкиСоответствия(
		УникальныйИдентификатор, 
		КлючФоновогоЗадания,
		ПолученныйОбъект,
		ОбъектФормата,
		УзелИнформационнойБазы);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ПроверитьВозможностьЗагрузкиДругихОбъектовЗавершение(ДлительнаяОперация, Неопределено);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПроверитьВозможностьЗагрузкиДругихОбъектовЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияПослеУстановкиСоответствия(УникальныйИдентификатор, КлючФоновогоЗадания, ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы)
	
	Возврат РаботаСРезультатамиОбмена.ДлительнаяОперацияПослеУстановкиСоответствия(
		УникальныйИдентификатор, КлючФоновогоЗадания, ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьВозможностьЗагрузкиДругихОбъектовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		РаботаСРезультатамиОбменаКлиент.ОбработатьРезультатыВыполненияГрупповойКомандыВСпискеПроблем(Результат.АдресРезультата, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
